app/controllers/school_classes_controller.rb

    def create
        @class = SchoolClass.create(class_params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "social studies"], ["room_number", 2]]

    def set_class
        @class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]