app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "fldjf"], ["last_name", "sdfsdf"], ["created_at", "2021-06-09 06:45:39.873485"], ["updated_at", "2021-06-09 06:45:39.873485"]]
---
    def create
        @student = Student.create(student_params(:first_name, :last_name))

UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Jordan@"], ["updated_at", "2021-06-09 06:45:11.438725"], ["id", 1]]
---
    def update
        @student.update(student_params(:first_name, :last_name))